let a = Number (prompt("Введите первое число"));
let b = Number (prompt("Введите второе число"));
q1 = a > b; //больше
q2 = a < b; //меньше
q3 = a == b; //равен
q4 = a != b; //неравен
q5 = a >= b; //больше или равен
q6 = a <= b; //меньше или равен
alert (
    a + ' > ' + b + ' = ' + q1 + "\n" +
    a + ' < ' + b + ' = ' + q2 + "\n" +
    a + ' = ' + b + ' = ' + q3 + "\n" +
    a + ' != ' + b + ' = ' + q4 + "\n" +
    a + ' >= ' + b + ' = ' + q5 + "\n" +
    a + ' <= ' + b + ' = ' + q6 + "\n" 
); 